In [21]:
import pandas as pd 
import numpy as np 
import seaborn as sns
import matplotlib as lyb

load data

In [22]:
data=pd.read_csv("../Data-cleaning-for-beginners-using-pandas.csv")
data.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [23]:
data.info()
data.shape
data.columns.tolist()
data.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        29 non-null     int64
 1   Age          22 non-null     float64
 2   Salary       29 non-null     object
 3   Rating       28 non-null     float64
 4   Location     29 non-null     object
 5   Established  29 non-null     int64
 6   Easy Apply   29 non-null     object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.7+ KB

Index(['Index', 'Age', 'Salary', 'Rating', 'Location', 'Established',
       'Easy Apply'],
      dtype='object')

Find missing values in columns

In [24]:
missingValues=data.isnull().sum()
print(missingValues)
missingInAge=data[data['Age'].isnull()]
print(missingInAge)

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64
    Index  Age     Salary  Rating       Location  Established Easy Apply
2       2  NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
12     12  NaN  $44k-$99k     0.0       India,In         1999         -1
17     17  NaN  $44k-$99k     5.3    New York,Ny         1943       TRUE
20     20  NaN  $44k-$99k     5.7    New York,Ny         1944       TRUE
23     23  NaN  $44k-$99k     2.4    New York,Ny         1999       TRUE
26     26  NaN  $55k-$66k     NaN       India,In         1934       TRUE
28     28  NaN  $39k-$88k     3.4  Australia Aus         1932         -1

Q4: Salary Cleaning
Q4.1 — Extract minimum salary into a new column named MinSalary.
Q4.2 — Extract maximum salary into a new column MaxSalary.
Q4.3 — Convert both into proper integers (44000, 99000, etc.).

In [32]:


#4.1
data["MinSalary"]=(
    data['Salary']
    .str.replace("$","",regex=False)
    .str.replace("k","",regex=False)
    .str.split("-",expand=True)[0]
    .astype(int)*1000

)

#4.2

data["MaxSalary"]=(
    data['Salary']
    .str.replace("$","",regex=False)
    .str.replace("k","",regex=False)
    .str.split("-",expand=True)[1]
    .astype(int)*1000
)
data.head()

,Index,Age,Salary,Rating,Location,Established,Easy Apply,MinSalary,MaxSalary
0,0,44.0,$44k-$99k,5.4,"India,In",1999,TRUE,44000,99000
1,1,66.0,$55k-$66k,3.5,"New York,Ny",2002,TRUE,55000,66000
2,2,NaN,$77k-$89k,-1.0,"New York,Ny",-1,-1,77000,89000
3,3,64.0,$44k-$99k,4.4,India In,1988,-1,44000,99000
4,4,25.0,$44k-$99k,6.4,Australia Aus,2002,-1,44000,99000

Now Let's Move to LEVEL 2 – Q5 (Location Cleaning)

In [46]:
data["Location"] = data["Location"].str.replace(" ", ",", 1)

data[["City","Country"]]=data['Location'].str.split(",",expand=True)


data.head()

ValueError: Columns must be same length as key